# Дан массив nums, содержащий n различных чисел в диапазоне [0, n]. Необходимо
# вернуть единственное число из диапазона, которого не хватает в массиве.

# Пример 1:

# Ввод: nums = [3,0,1]

# Вывод: 2

# Объяснение: n = 3, так как в массиве 3 числа, следовательно, все числа
# находятся в диапазоне [0,3]. Число 2 отсутствует в этом диапазоне, так как
# оно не встречается в nums.

# Пример 2:

# Ввод: nums = [0,1]

# Вывод: 2

# Объяснение: n = 2, так как в массиве 2 числа, следовательно, все числа
# находятся в диапазоне [0,2]. Число 2 отсутствует в этом диапазоне, так как
# оно не встречается в nums.

# Пример 3:

# Ввод: nums = [9,6,4,2,3,5,7,0,1]

# Вывод: 8

# Объяснение: n = 9, так как в массиве 9 чисел, следовательно, все числа
# находятся в диапазоне [0,9]. Число 8 отсутствует в этом диапазоне, так как
# оно не встречается в nums.


class Solution:
    def missing_number(self, nums: list[int]) -> int:
        return sum(range(0, len(nums) + 1)) - sum(nums)
